Revit 2027 API
ParameterTypeId.SurfaceName Property
 "Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SurfaceName { get; }
Public Shared ReadOnly Property SurfaceName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SurfaceName {
	ForgeTypeId^ get ();
}
static member SurfaceName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace